GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd.c
/*
 * Copyright (c) 2020-2021 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv7m.h"
#include "stm32wb_gpio.h"
#include "stm32wb_exti.h"
#include "stm32wb_lptim.h"
#include "stm32wb_system.h"
#include "stm32wb_usbd.h"
#include "stm32wb_usbd_dcd.h"

#define STM32WB_USBD_STATE_NONE         0
#define STM32WB_USBD_STATE_INIT         1
#define STM32WB_USBD_STATE_NOT_READY    2
#define STM32WB_USBD_STATE_READY        3
#define STM32WB_USBD_STATE_ATTACHED     4
#define STM32WB_USBD_STATE_POWERED      5
#define STM32WB_USBD_STATE_DEFAULT      6
#define STM32WB_USBD_STATE_ADDRESSED    7
#define STM32WB_USBD_STATE_CONFIGURED   8

#define STM32WB_USBD_EP0_STATE_SETUP    0
#define STM32WB_USBD_EP0_STATE_DATA_IN  1
#define STM32WB_USBD_EP0_STATE_DATA_OUT 2
#define STM32WB_USBD_EP0_STATE_STATUS   3
#define STM32WB_USBD_EP0_STATE_REQUEST  4

typedef struct _stm32wb_usbd_control_t {
    volatile uint8_t              state;
    volatile uint8_t              connect;
    volatile uint8_t              disconnect;
    volatile uint8_t              vbus_status;
    volatile uint8_t              self_powered;
    volatile uint8_t              suspended;
#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
    volatile uint8_t              remote_wakeup;
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */
    uint8_t                       pin_vbus;
    uint8_t                       if_count;
    uint32_t                      ep_mask;
    const stm32wb_usbd_device_t   *device;
    const stm32wb_usbd_info_t     *info;
    volatile uint32_t             events;
    stm32wb_usbd_event_callback_t evt_callback;
    void                          *evt_context;
    uint8_t                       ep0_setup[8];
    stm32wb_usbd_request_t        ep0_request;
    stm32wb_usbd_status_routine_t ep0_status_routine;    
    uint8_t                       *ep0_out_data;
    uint16_t                      ep0_out_size;
    uint16_t                      ep0_out_count;
    const uint8_t                 *ep0_in_data;
    uint16_t                      ep0_in_length;
    bool                          ep0_in_zlp;
    uint8_t                       ep0_state;
    stm32wb_lptim_timeout_t       timeout;
} stm32wb_usbd_control_t;

static stm32wb_usbd_control_t stm32wb_usbd_control;

static void stm32wb_usbd_event_callback(void *context, uint32_t events);

static void stm32wb_usbd_connect(void)
{
    stm32wb_usbd_dcd_connect(stm32wb_usbd_control.disconnect);

    stm32wb_usbd_control.disconnect = false;
    
    stm32wb_usbd_control.state = STM32WB_USBD_STATE_POWERED;
}

static void stm32wb_usbd_disconnect(void)
{
    uint32_t index;
    const stm32wb_usbd_info_t *info;

    if (stm32wb_usbd_control.state == STM32WB_USBD_STATE_CONFIGURED)
    {
        info = stm32wb_usbd_control.info;
        
        for (index = 0; index < info->class_count; index++)
        {
            (*info->class_table[index]->stop)(info->class_table[index]->context);
        }
    }
    
    stm32wb_usbd_dcd_disconnect();
    
    stm32wb_usbd_control.state = STM32WB_USBD_STATE_ATTACHED;
}

static void stm32wb_usbd_vbus_timeout(void)
{
    uint8_t vbus_status;
    
    if (stm32wb_usbd_control.pin_vbus == STM32WB_GPIO_PIN_PVM1)
    {
        vbus_status = stm32wb_system_pvm1_sense();
    }
    else
    {
        vbus_status = !!stm32wb_gpio_pin_read(stm32wb_usbd_control.pin_vbus);
    }

    if (vbus_status && stm32wb_usbd_control.vbus_status)
    {
        stm32wb_usbd_dcd_enable(&stm32wb_usbd_control.ep0_setup[0], stm32wb_usbd_event_callback, NULL);

        stm32wb_usbd_control.state = STM32WB_USBD_STATE_ATTACHED;

        if (stm32wb_usbd_control.evt_callback)
        {
            (*stm32wb_usbd_control.evt_callback)(stm32wb_usbd_control.evt_context, STM32WB_USBD_EVENT_ATTACH);
        }

        if (stm32wb_usbd_control.connect)
        {
            stm32wb_usbd_connect();
        }
    }
}

static void stm32wb_usbd_vbus_changed(void)
{
    uint8_t vbus_status_previous;

    vbus_status_previous = stm32wb_usbd_control.vbus_status;
    
    if (stm32wb_usbd_control.pin_vbus == STM32WB_GPIO_PIN_PVM1)
    {
        stm32wb_usbd_control.vbus_status = stm32wb_system_pvm1_sense();
    }
    else
    {
        stm32wb_usbd_control.vbus_status = !!stm32wb_gpio_pin_read(stm32wb_usbd_control.pin_vbus);
    }
    
    if (stm32wb_usbd_control.vbus_status)
    {
        if (!vbus_status_previous)
        {
            stm32wb_lptim_timeout_relative(&stm32wb_usbd_control.timeout, STM32WB_LPTIM_TIMEOUT_MILLIS_TO_TICKS(40), (stm32wb_lptim_timeout_callback_t)stm32wb_usbd_vbus_timeout, NULL);
        }
    }
    else
    {
        stm32wb_lptim_timeout_cancel(&stm32wb_usbd_control.timeout);

