GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd.c
        if (vbus_status_previous)
        {
            if (stm32wb_usbd_control.state >= STM32WB_USBD_STATE_POWERED)
            {
                stm32wb_usbd_disconnect();
            }
            
            if (stm32wb_usbd_control.state >= STM32WB_USBD_STATE_ATTACHED)
            {
                if (stm32wb_usbd_control.evt_callback)
                {
                    (*stm32wb_usbd_control.evt_callback)(stm32wb_usbd_control.evt_context, STM32WB_USBD_EVENT_DETACH);
                }

                stm32wb_usbd_dcd_disable();
            }

            stm32wb_usbd_control.state = STM32WB_USBD_STATE_READY;
        }
    }
}

static void stm32wb_usbd_pvm1_changed(void)
{
    armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_USBD_PVM1);
}

static int stm32wb_usbd_device(uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return)
{
    const stm32wb_usbd_device_t *device = stm32wb_usbd_control.device;
    const stm32wb_usbd_info_t *info = stm32wb_usbd_control.info;

    *p_data_return = data;
    *p_length_return = 18;
    
    data[0]  = 18;                                   /* bLength */
    data[1]  = USB_DESCRIPTOR_TYPE_DEVICE;           /* bDescriptorType */ 
    data[2]  = info->bos ? 0x10 : 0x00;              /* bcdUSB */
    data[3]  = 0x02;
    data[4]  = 0xef;                                 /* bDeviceClass */
    data[5]  = 0x02;                                 /* bDeviceSubClass */
    data[6]  = 0x01;                                 /* bDeviceProtocol */
    data[7]  = STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE; /* bMaxPacketSize */
    data[8]  = device->vid & 255;                    /* idVendor */
    data[9]  = device->vid >> 8;
    data[10] = device->pid & 255;                    /* idProduct */
    data[11] = device->pid >> 8;
    data[12] = device->did & 255;                    /* bcdDevice */
    data[13] = device->did >> 8;
    data[14] = USB_STRING_INDEX_MANUFACTURER;        /* Index of manufacturer string */
    data[15] = USB_STRING_INDEX_PRODUCT;             /* Index of product string */
    data[16] = USB_STRING_INDEX_SERIAL;              /* Index of serial number string */
    data[17] = 1;                                    /* bNumConfigurations */
    
    return STM32WB_USBD_REQUEST_STATUS_SUCCESS;
}

static int stm32wb_usbd_configuration(uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return)
{
    const stm32wb_usbd_info_t *info;
    const uint8_t *configuration;
    
    info = stm32wb_usbd_control.info;
    configuration = info->configuration;

    if (!configuration)
    {
        return STM32WB_USBD_REQUEST_STATUS_FAILURE;
    }
    
    *p_data_return = configuration;
    *p_length_return = (configuration[2] << 0) | (configuration[3] << 8);

    return STM32WB_USBD_REQUEST_STATUS_SUCCESS;
}

static int stm32wb_usbd_bos(uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return)
{
    const stm32wb_usbd_info_t *info;
    const uint8_t *bos;
    
    info = stm32wb_usbd_control.info;
    bos = info->bos;

    if (!bos)
    {
        return STM32WB_USBD_REQUEST_STATUS_FAILURE;
    }
    
    *p_data_return = bos;
    *p_length_return = (bos[2] << 0) | (bos[3] << 8);

    return STM32WB_USBD_REQUEST_STATUS_SUCCESS;
}

static int stm32wb_usbd_msos20(uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return)
{
    const stm32wb_usbd_info_t *info;
    const uint8_t *msos20;
    
    info = stm32wb_usbd_control.info;
    msos20 = info->msos20;

    if (!msos20)
    {
        return STM32WB_USBD_REQUEST_STATUS_FAILURE;
    }
    
    *p_data_return = msos20;
    *p_length_return = (msos20[8] << 0) | (msos20[9] << 8);

    return STM32WB_USBD_REQUEST_STATUS_SUCCESS;
}

static int stm32wb_usbd_string(uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return, const char *string)
{
    uint32_t count, length;
    uint8_t *data_e;

    if (!string)
    {
        return STM32WB_USBD_REQUEST_STATUS_FAILURE;
    }
    
    count = strlen(string);

    if (count > ((STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE / 2) -1))
    {
        count = (STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE / 2) -1;
    }

    length = (2 + (count * 2));

    *p_data_return = data;
    *p_length_return = length;
    
    data_e = data + length;

    *data++ = length;
    *data++ = USB_DESCRIPTOR_TYPE_STRING;

    while (data != data_e)
    {
        *data++ = *string++;
        *data++ = 0;
    }
    
    return STM32WB_USBD_REQUEST_STATUS_SUCCESS;
}

static int stm32wb_usbd_language(uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return)
{
    static const uint8_t language[4] = {
        4,
        USB_DESCRIPTOR_TYPE_STRING,
        (uint8_t)((1033) & 255),
        (uint8_t)((1033) >> 8)
    };

    *p_data_return = (uint8_t*)&language[0];
    *p_length_return = language[0];
    
    return STM32WB_USBD_REQUEST_STATUS_SUCCESS;
}

static int stm32wb_usbd_serial(uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return)
{
    uint64_t serial;
    uint32_t serial_l, serial_h, length;
    int shift;

    static const uint8_t hex2ascii[16] = "0123456789ABCDEF";
    
    serial = stm32wb_system_serial();

    serial_l = (uint32_t)(serial >> 0);
    serial_h = (uint32_t)(serial >> 32);

    length = (2 + (12 * 2));

    *p_data_return = data;
    *p_length_return = length;
    
    *data++ = 26;
    *data++ = USB_DESCRIPTOR_TYPE_STRING;

    for (shift = (16-4); shift >= 0; shift -= 4)
    {
        *data++ = hex2ascii[(serial_h >> shift) & 15];
        *data++ = 0;
    }

    for (shift = (32-4); shift >= 0; shift -= 4)
    {
        *data++ = hex2ascii[(serial_l >> shift) & 15];
        *data++ = 0;
    }
    
    return STM32WB_USBD_REQUEST_STATUS_SUCCESS;
}

static void stm32wb_usbd_set_address()
{
    stm32wb_usbd_dcd_address(stm32wb_usbd_control.ep0_request.wValue & 0x7f);
}

static bool stm32wb_usbd_request(const stm32wb_usbd_request_t *request, uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return, stm32wb_usbd_status_routine_t *p_status_routine_return)
{
    uint32_t index, interface, if_base, ep_addr, ep_mask, type;
    int state, status;
    const stm32wb_usbd_info_t *info;

    info = stm32wb_usbd_control.info;
    state = (stm32wb_usbd_control.state < STM32WB_USBD_STATE_ATTACHED) ? USB_STATE_NONE : (stm32wb_usbd_control.state - (STM32WB_USBD_STATE_ATTACHED - USB_STATE_ATTACHED));
    status = STM32WB_USBD_REQUEST_STATUS_UNHANDLED;
    
    switch (request->bmRequestType & USB_REQ_RECIPIENT_MASK) {
    case USB_REQ_RECIPIENT_DEVICE:
        for (index = 0; index < info->class_count; index++)
        {
            status = (*info->class_table[index]->request)(info->class_table[index]->context, state, request, data, p_data_return, p_length_return, p_status_routine_return);

            if (status != STM32WB_USBD_REQUEST_STATUS_UNHANDLED)
            {
                break;
            }
        }

        if (status == STM32WB_USBD_REQUEST_STATUS_UNHANDLED)
        {
            switch (request->bmRequestType & USB_REQ_TYPE_MASK) {
            case USB_REQ_TYPE_STANDARD: {
                switch (request->bRequest) {
                case USB_REQ_CODE_GET_STATUS: {
                    if ((state == USB_STATE_ADDRESSED) || (state == USB_STATE_CONFIGURED))
                    {
                        *p_data_return = data;
                        *p_length_return = 2;
                        
