GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd.c
#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
                        data[0] = (stm32wb_usbd_control.remote_wakeup ? 0x02 : 0x00) | (stm32wb_usbd_control.self_powered ? 0x01 : 0x00);
#else /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */
                        data[0] = (stm32wb_usbd_control.self_powered ? 0x01 : 0x00);
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */
                        data[1] = 0x00;
                        
                        status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    }
                    break;
                }
                    
                case USB_REQ_CODE_CLEAR_FEATURE: {
#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
                    if (request->wValue == USB_FEATURE_DEVICE_REMOTE_WAKEUP)
                    {
                        if ((state == USB_STATE_ADDRESSED) || (state == USB_STATE_CONFIGURED))
                        {
                            stm32wb_usbd_control.remote_wakeup = false;
                            
                            status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                        }
                    }
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */
                    break;
                }
                    
                case USB_REQ_CODE_SET_FEATURE: {
#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
                    if (request->wValue == USB_FEATURE_DEVICE_REMOTE_WAKEUP)
                    {
                        if ((state == USB_STATE_ADDRESSED) || (state == USB_STATE_CONFIGURED))
                        {
                            stm32wb_usbd_control.remote_wakeup = true;
                        
                            status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                        }
                    }
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */
                    break;
                }
                    
                case USB_REQ_CODE_SET_ADDRESS: {
                    if ((state == USB_STATE_DEFAULT) || (state == USB_STATE_ADDRESSED))
                    {
                        *p_status_routine_return = stm32wb_usbd_set_address;
                        
                        stm32wb_usbd_control.state = (request->wValue & 0x7f) ? STM32WB_USBD_STATE_ADDRESSED : STM32WB_USBD_STATE_DEFAULT;

                        status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    }
                    break;
                }
                    
                case USB_REQ_CODE_GET_DESCRIPTOR: {
                    type = request->wValue >> 8;
                    index = request->wValue & 255;

                    switch (type) {
                    case USB_DESCRIPTOR_TYPE_DEVICE: {
                        status = stm32wb_usbd_device(data, p_data_return, p_length_return);
                        break;
                    }
                        
                    case USB_DESCRIPTOR_TYPE_CONFIGURATION: {
                        status = stm32wb_usbd_configuration(data, p_data_return, p_length_return);
                        break;
                    }

                    case USB_DESCRIPTOR_TYPE_STRING: {
                        switch (index) {
                        case USB_STRING_INDEX_LANGID: {
                            status = stm32wb_usbd_language(data, p_data_return, p_length_return);
                            break;
                        }

                        case USB_STRING_INDEX_MANUFACTURER: {
                            status = stm32wb_usbd_string(data, p_data_return, p_length_return, stm32wb_usbd_control.device->manufacturer);
                            break;
                        }

                        case USB_STRING_INDEX_PRODUCT: {
                            status = stm32wb_usbd_string(data, p_data_return, p_length_return, stm32wb_usbd_control.device->product);
                            break;
                        }

                        case USB_STRING_INDEX_SERIAL: {
                            status = stm32wb_usbd_serial(data, p_data_return, p_length_return);
                            break;
                        }

                        default: {
                            if ((index - USB_STRING_INDEX_CUSTOM) < info->string_count)
                            {
                                status = stm32wb_usbd_string(data, p_data_return, p_length_return, info->string_table[index - USB_STRING_INDEX_CUSTOM]);
                            }
                            break;
                        }
                        }
                        break;
                    }

                    case USB_DESCRIPTOR_TYPE_BOS: {
                        status = stm32wb_usbd_bos(data, p_data_return, p_length_return);
                        break;
                    }
                        
                    default:
                        break;
                    }
                    break;
                }
                    
                case USB_REQ_CODE_SET_DESCRIPTOR: {
                    break;
                }
                    
                case USB_REQ_CODE_GET_CONFIGURATION: {
                    if ((state == USB_STATE_ADDRESSED) || (state == USB_STATE_CONFIGURED))
                    {
                        *p_data_return = data;
                        *p_length_return = 1;
                        
                        data[0] = (state == USB_STATE_ADDRESSED) ? 0 : 1;

                        status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    }
                    break;
                }
                    
                case USB_REQ_CODE_SET_CONFIGURATION: {
                    if ((state == USB_STATE_ADDRESSED) || (state == USB_STATE_CONFIGURED))
                    {
                        if (request->wValue == 0)
                        {
                            if (state == USB_STATE_CONFIGURED)
                            {
                                for (index = 0; index < info->class_count; index++)
                                {
                                    (*info->class_table[index]->stop)(info->class_table[index]->context);
                                }
                            }
                                
                            stm32wb_usbd_control.state = STM32WB_USBD_STATE_ADDRESSED;
                        }
                        else
                        {
                            if (state == USB_STATE_ADDRESSED)
                            {
                                for (index = 0; index < info->class_count; index++)
                                {
                                    (*info->class_table[index]->start)(info->class_table[index]->context);
                                }
                            }
                            
                            stm32wb_usbd_control.state = STM32WB_USBD_STATE_CONFIGURED;
                        }
                        
                        status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                    }
                    break;
                }
                    
                default:
                    break;
                }
                break;
            }

            case USB_REQ_TYPE_VENDOR: {
                switch (request->bRequest) {
                case USB_REQ_MS_VENDOR_CODE: {
                    switch (request->wIndex) {
                    case MS_OS_2O_DESCRIPTOR_INDEX: {
                        status = stm32wb_usbd_msos20(data, p_data_return, p_length_return);
                        break;
                    }
                        
                    default:
                        break;
                    }
                    break;
                }
                    
                default:
                    break;
                }
                break;
            }

            default:
                break;
            }
        }
        break;

    case USB_REQ_RECIPIENT_INTERFACE:
        interface = request->wIndex;

        if (interface < stm32wb_usbd_control.if_count)
        {
            for (index = 0, if_base = 0; index < info->class_count; index++)
            {
                if ((if_base <= interface) && ((if_base + info->class_table[index]->if_count) > interface))
                {
                    status = (*info->class_table[index]->request)(info->class_table[index]->context, state, request, data, p_data_return, p_length_return, p_status_routine_return);
                        
                    break;
                }

