GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd.c
                if_base += info->class_table[index]->if_count;
            }
                
            if (status == STM32WB_USBD_REQUEST_STATUS_UNHANDLED)
            {
                switch (request->bmRequestType & USB_REQ_TYPE_MASK) {
                case USB_REQ_TYPE_STANDARD: {
                    switch (request->bRequest) {
                    case USB_REQ_CODE_GET_STATUS: {
                        if (((state == USB_STATE_ADDRESSED) && !interface) || (state == USB_STATE_CONFIGURED))
                        {
                            *p_data_return = data;
                            *p_length_return = 2;
                            
                            data[0] = 0x00;
                            data[1] = 0x00;
                            
                            status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                        }
                        break;
                    }
                        
                    case USB_REQ_CODE_CLEAR_FEATURE: {
                        /* No standard features defined */
                        break;
                    }
                            
                    case USB_REQ_CODE_SET_FEATURE: {
                        /* No standard features defined */
                        break;
                    }
                            
                    case USB_REQ_CODE_GET_INTERFACE: {
                        /* Must be handled by the index, defaults to 0 */
                        if (state == USB_STATE_CONFIGURED)
                        {
                            *p_data_return = data;
                            *p_length_return = 1;
                            
                            data[0] = 0x00;
                            
                            status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                        }
                        break;
                    }
                            
                    case USB_REQ_CODE_SET_INTERFACE: {
                        /* Must be handled by the index, or default to error */
                        break;
                    }
                            
                    default:
                        break;
                    }

                    break;
                }
                    
                default:
                    break;
                }
            }
        }
        break;

    case USB_REQ_RECIPIENT_ENDPOINT:
        ep_addr = request->wIndex & 0x8f;
        ep_mask = STM32WB_USBD_EP_MASK(ep_addr);

        if (ep_mask & stm32wb_usbd_control.ep_mask)
        {
            for (index = 0; index < info->class_count; index++)
            {
                if (ep_mask & info->class_table[index]->ep_mask)
                {
                    status = (*info->class_table[index]->request)(info->class_table[index]->context, state, request, data, p_data_return, p_length_return, p_status_routine_return);
                        
                    break;
                }
            }
                
            if (status == STM32WB_USBD_REQUEST_STATUS_UNHANDLED)
            {
                switch (request->bmRequestType & USB_REQ_TYPE_MASK) {
                case USB_REQ_TYPE_STANDARD: {
                    switch (request->bRequest) {
                    case USB_REQ_CODE_GET_STATUS: {
                        if (((state == USB_STATE_ADDRESSED) && !(ep_addr & 0x0f)) || (state == USB_STATE_CONFIGURED))
                        {
                            *p_data_return = data;
                            *p_length_return = 2;
                            
                            data[0] = ((ep_addr & 0x0f) && stm32wb_usbd_dcd_ep_is_stalled(ep_addr)) ? 0x01 : 0x00;
                            data[1] = 0x00;
                        
                            status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                        }
                        break;
                    }
                        
                    case USB_REQ_CODE_CLEAR_FEATURE: {
                        if (request->wValue == USB_FEATURE_ENDPOINT_HALT)
                        {
                            if (((state == USB_STATE_ADDRESSED) && !(ep_addr & 0x0f)) || (state == USB_STATE_CONFIGURED))
                            {
                                if ((ep_addr & 0x0f) && stm32wb_usbd_dcd_ep_unstall(ep_addr))
                                {
                                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                                }
                            }
                        }
                        break;
                    }
                        
                    case USB_REQ_CODE_SET_FEATURE: {
                        if (request->wValue == USB_FEATURE_ENDPOINT_HALT)
                        {
                            if (((state == USB_STATE_ADDRESSED) && !(ep_addr & 0x0f)) || (state == USB_STATE_CONFIGURED))
                            {
                                if ((ep_addr & 0x0f) && stm32wb_usbd_dcd_ep_stall(ep_addr))
                                {
                                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                                }
                            }
                        }
                        break;
                    }
                        
                    default:
                        break;
                    }

                    break;
                }

                default:
                    break;
                }
            }
        }
        break;

    default:
        break;
    }
    
    return (status == STM32WB_USBD_REQUEST_STATUS_SUCCESS);
}

static void stm32wb_usbd_event_callback(void *context, uint32_t events)
{
    uint32_t count, index;
    const stm32wb_usbd_info_t *info;
    
    info = stm32wb_usbd_control.info;
    
    if (events & STM32WB_USBD_DCD_EVENT_RESET)
    {
        if (stm32wb_usbd_control.state == STM32WB_USBD_STATE_CONFIGURED)
        {
            for (index = 0; index < info->class_count; index++)
            {
                (*info->class_table[index]->stop)(info->class_table[index]->context);
            }
        }

