GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd.c
        stm32wb_usbd_dcd_reset();

        if (stm32wb_usbd_control.state == STM32WB_USBD_STATE_POWERED)
        {
            if (stm32wb_usbd_control.evt_callback)
            {
                (*stm32wb_usbd_control.evt_callback)(stm32wb_usbd_control.evt_context, STM32WB_USBD_EVENT_CONNECT);
            }
        }
        
        stm32wb_usbd_control.state = STM32WB_USBD_STATE_DEFAULT;

        stm32wb_usbd_control.suspended = false;
#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
        stm32wb_usbd_control.remote_wakeup = false;
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */

        events &= ~(STM32WB_USBD_DCD_EVENT_EP0_SETUP | STM32WB_USBD_DCD_EVENT_EP0_DATA_IN |  STM32WB_USBD_DCD_EVENT_EP0_DATA_OUT);
    }
    
    if (events & (STM32WB_USBD_DCD_EVENT_SUSPEND))
    {
        stm32wb_usbd_control.suspended = true;
      
        for (index = 0; index < info->class_count; index++)
        {
            (*info->class_table[index]->suspend)(info->class_table[index]->context);
        }

        if (stm32wb_usbd_control.evt_callback)
        {
            (*stm32wb_usbd_control.evt_callback)(stm32wb_usbd_control.evt_context, STM32WB_USBD_EVENT_SUSPEND);
        }

        events &= ~(STM32WB_USBD_DCD_EVENT_EP0_SETUP | STM32WB_USBD_DCD_EVENT_EP0_DATA_IN |  STM32WB_USBD_DCD_EVENT_EP0_DATA_OUT);
    }

    if (events & STM32WB_USBD_DCD_EVENT_RESUME)
    {
        if (stm32wb_usbd_control.suspended)
        {
            stm32wb_usbd_control.suspended = false;
        
            for (index = 0; index < info->class_count; index++)
            {
                (*info->class_table[index]->resume)(info->class_table[index]->context);
            }
            
            if (stm32wb_usbd_control.evt_callback)
            {
                (*stm32wb_usbd_control.evt_callback)(stm32wb_usbd_control.evt_context, STM32WB_USBD_EVENT_RESUME);
            }
        }
    }

    if (events & STM32WB_USBD_DCD_EVENT_EP0_SETUP)
    {
        armv7m_atomic_load_2_restart((volatile uint32_t*)&stm32wb_usbd_control.ep0_setup, &(((uint32_t*)&stm32wb_usbd_control.ep0_request)[0]), &(((uint32_t*)&stm32wb_usbd_control.ep0_request)[1]));

        stm32wb_usbd_control.ep0_status_routine = NULL;
        stm32wb_usbd_control.ep0_out_data = stm32wb_usbd_control.info->ep0_data;
        stm32wb_usbd_control.ep0_out_size = stm32wb_usbd_control.info->ep0_size;
        stm32wb_usbd_control.ep0_out_count = 0;
        stm32wb_usbd_control.ep0_in_data = NULL;
        stm32wb_usbd_control.ep0_in_length = 0;
        stm32wb_usbd_control.ep0_in_zlp = false;
        
        if ((stm32wb_usbd_control.ep0_request.bmRequestType & USB_REQ_DIRECTION_DEVICE_TO_HOST) || (stm32wb_usbd_control.ep0_request.wLength == 0))
        {
            stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_REQUEST;
        }
        else
        {
            if (stm32wb_usbd_control.ep0_request.wLength <= stm32wb_usbd_control.ep0_out_size)
            {
                count = stm32wb_usbd_control.ep0_request.wLength;
                
                if (count > STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE)
                {
                    count = STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE;
                }
                
                stm32wb_usbd_dcd_ep0_receive(&stm32wb_usbd_control.ep0_out_data[stm32wb_usbd_control.ep0_out_count], count);
                
                stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_DATA_OUT;
            }
            else
            {
                stm32wb_usbd_dcd_ep0_stall();
                
                stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_SETUP;
            }
        }
    }
    
    if (events & STM32WB_USBD_DCD_EVENT_EP0_DATA_IN)
    {
        if (stm32wb_usbd_control.ep0_state == STM32WB_USBD_EP0_STATE_STATUS)
        {
            if (stm32wb_usbd_control.ep0_status_routine)
            {
                (*stm32wb_usbd_control.ep0_status_routine)();
            }

            stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_SETUP;
        }
        
        if (stm32wb_usbd_control.ep0_state == STM32WB_USBD_EP0_STATE_DATA_IN)
        {
            if (stm32wb_usbd_control.ep0_in_length)
            {
                count = stm32wb_usbd_control.ep0_in_length;
            
                if (count > STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE)
                {
                    count = STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE;
                }
            
                stm32wb_usbd_dcd_ep0_transmit(stm32wb_usbd_control.ep0_in_data, count);
            
                stm32wb_usbd_control.ep0_in_data += count;
                stm32wb_usbd_control.ep0_in_length -= count;
            }
            else if (stm32wb_usbd_control.ep0_in_zlp)
            {
                stm32wb_usbd_dcd_ep0_transmit(NULL, 0);

                stm32wb_usbd_control.ep0_in_zlp = false;
            }
            else
            {
                stm32wb_usbd_dcd_ep0_receive(NULL, 0);

                stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_STATUS;
            }
        }

    }

    if (events & STM32WB_USBD_DCD_EVENT_EP0_DATA_OUT)
    {
        if (stm32wb_usbd_control.ep0_state == STM32WB_USBD_EP0_STATE_STATUS)
        {
            if (stm32wb_usbd_control.ep0_status_routine)
            {
                (*stm32wb_usbd_control.ep0_status_routine)();
            }

            stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_SETUP;
        }

        if (stm32wb_usbd_control.ep0_state == STM32WB_USBD_EP0_STATE_DATA_OUT)
        {
            count = stm32wb_usbd_dcd_ep0_count();

            if (count && ((stm32wb_usbd_control.ep0_out_count + count) <= stm32wb_usbd_control.ep0_request.wLength))
            {
                stm32wb_usbd_control.ep0_out_count += count;
                
                if (stm32wb_usbd_control.ep0_out_count != stm32wb_usbd_control.ep0_request.wLength)
                {
                    count = (stm32wb_usbd_control.ep0_request.wLength - stm32wb_usbd_control.ep0_out_count);
                    
