GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd.c
                    if (count > STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE)
                    {
                        count = STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE;
                    }

                    stm32wb_usbd_dcd_ep0_receive(&stm32wb_usbd_control.ep0_out_data[stm32wb_usbd_control.ep0_out_count], count);
                }
                else
                {
                    stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_REQUEST;
                }
            }
            else
            {
                stm32wb_usbd_dcd_ep0_stall();

                stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_SETUP;
            }
        }
    }

    if (stm32wb_usbd_control.ep0_state == STM32WB_USBD_EP0_STATE_REQUEST)
    {
        // armv7m_rtt_printf(">> USBD_REQUEST(type=%02x, request=%d, value=%04x, index=%04x, length=%d)\n", stm32wb_usbd_control.ep0_request.bmRequestType, stm32wb_usbd_control.ep0_request.bRequest, stm32wb_usbd_control.ep0_request.wValue, stm32wb_usbd_control.ep0_request.wIndex, stm32wb_usbd_control.ep0_request.wLength);
        
        if (stm32wb_usbd_request(&stm32wb_usbd_control.ep0_request, stm32wb_usbd_control.ep0_out_data, &stm32wb_usbd_control.ep0_in_data, &stm32wb_usbd_control.ep0_in_length, &stm32wb_usbd_control.ep0_status_routine))
        {
            if ((stm32wb_usbd_control.ep0_request.bmRequestType & USB_REQ_DIRECTION_DEVICE_TO_HOST) && stm32wb_usbd_control.ep0_request.wLength)
            {
                // armv7m_rtt_printf("<< USBD_SUCCESS(length=%d)\n", stm32wb_usbd_control.ep0_in_length);

                if (stm32wb_usbd_control.ep0_in_length)
                {
                    if (stm32wb_usbd_control.ep0_in_length >= stm32wb_usbd_control.ep0_request.wLength)
                    {
                        stm32wb_usbd_control.ep0_in_length = stm32wb_usbd_control.ep0_request.wLength;
                        stm32wb_usbd_control.ep0_in_zlp = false;
                    }
                    else
                    {
                        stm32wb_usbd_control.ep0_in_zlp = !(stm32wb_usbd_control.ep0_in_length & (STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE -1));
                    }
                    
                    count = stm32wb_usbd_control.ep0_in_length;
                    
                    if (count > STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE)
                    {
                        count = STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE;
                    }
                    
                    stm32wb_usbd_dcd_ep0_transmit(stm32wb_usbd_control.ep0_in_data, count);
                    
                    stm32wb_usbd_control.ep0_in_data += count;
                    stm32wb_usbd_control.ep0_in_length -= count;
                    
                    stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_DATA_IN;
                }
                else
                {
                    stm32wb_usbd_dcd_ep0_transmit(NULL, 0);
                
                    stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_DATA_IN;
                }
            }
            else
            {
                // armv7m_rtt_printf("<< USBD_SUCCESS()\n");

                stm32wb_usbd_dcd_ep0_transmit(NULL, 0);
                
                stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_STATUS;
            }
        }
        else
        {
            // armv7m_rtt_printf("<< USBD_FAILURE()\n");

            stm32wb_usbd_dcd_ep0_stall();
            
            stm32wb_usbd_control.ep0_state = STM32WB_USBD_EP0_STATE_SETUP;
        }
    }
}

bool stm32wb_usbd_configure(const stm32wb_usbd_device_t *device, const stm32wb_usbd_info_t *info, const stm32wb_usbd_params_t *params)
{
    uint32_t index, if_base;
    
    if (stm32wb_usbd_control.state != STM32WB_USBD_STATE_NONE)
    {
        return false;
    }

    stm32wb_usbd_control.device = device;
    stm32wb_usbd_control.info = info;
    stm32wb_usbd_control.pin_vbus = params->pin_vbus;
    stm32wb_usbd_control.timeout = STM32WB_LPTIM_TIMEOUT_INIT();

    stm32wb_usbd_control.state = STM32WB_USBD_STATE_INIT;

    stm32wb_usbd_dcd_configure();
    
    for (index = 0, if_base = 0; index < info->class_count; index++)
    {
        (*info->class_table[index]->configure)(info->class_table[index]->context, if_base);
        
        if_base += info->class_table[index]->if_count;

        stm32wb_usbd_control.ep_mask |= info->class_table[index]->ep_mask;
    }

    stm32wb_usbd_control.if_count = if_base;

    return true;
}

static bool __svc_stm32wb_usbd_enable(stm32wb_usbd_event_callback_t callback, void *context)
{
    if (stm32wb_usbd_control.state != STM32WB_USBD_STATE_INIT)
    {
        return false;
    }

    stm32wb_usbd_control.state = STM32WB_USBD_STATE_NOT_READY;
    stm32wb_usbd_control.connect = false;
    stm32wb_usbd_control.disconnect = true;

    stm32wb_usbd_control.evt_callback = callback;
    stm32wb_usbd_control.evt_context = context;

    stm32wb_usbd_control.state = STM32WB_USBD_STATE_READY;
    
    if (stm32wb_usbd_control.pin_vbus != STM32WB_GPIO_PIN_NONE)
    {
        if (stm32wb_usbd_control.pin_vbus == STM32WB_GPIO_PIN_PVM1)
        {
            stm32wb_system_pvm1_enable((stm32wb_system_pvm1_callback_t)stm32wb_usbd_pvm1_changed, NULL);
        
            stm32wb_usbd_control.vbus_status = stm32wb_system_pvm1_sense();
        }
        else
        {
            stm32wb_gpio_pin_configure(stm32wb_usbd_control.pin_vbus, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_PUPD_PULLDOWN | STM32WB_GPIO_OSPEED_LOW | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_INPUT));
            stm32wb_exti_catch(stm32wb_usbd_control.pin_vbus, (STM32WB_EXTI_CONTROL_PRIORITY_LOW | STM32WB_EXTI_CONTROL_EDGE_RISING | STM32WB_EXTI_CONTROL_EDGE_FALLING), (stm32wb_exti_callback_t)stm32wb_usbd_vbus_changed, NULL);

            stm32wb_usbd_control.vbus_status = !!stm32wb_gpio_pin_read(stm32wb_usbd_control.pin_vbus);
        }
    
        if (stm32wb_usbd_control.vbus_status)
        {
            stm32wb_lptim_timeout_relative(&stm32wb_usbd_control.timeout, STM32WB_LPTIM_TIMEOUT_MILLIS_TO_TICKS(40), (stm32wb_lptim_timeout_callback_t)stm32wb_usbd_vbus_timeout, NULL); /* 40ms */
        }
    }
    else
    {
        stm32wb_usbd_dcd_enable(&stm32wb_usbd_control.ep0_setup[0], stm32wb_usbd_event_callback, NULL);

        stm32wb_usbd_control.state = STM32WB_USBD_STATE_ATTACHED;
    }
    
