GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd.c
    return true;
}

static bool __svc_stm32wb_usbd_disable(void)
{
    if (stm32wb_usbd_control.state <= STM32WB_USBD_STATE_READY)
    {
        return false;
    }

    if (stm32wb_usbd_control.state >= STM32WB_USBD_STATE_POWERED)
    {
        stm32wb_usbd_disconnect();
    }

    if (stm32wb_usbd_control.state >= STM32WB_USBD_STATE_ATTACHED)
    {
        stm32wb_usbd_dcd_disable();
    }

    stm32wb_usbd_control.state = STM32WB_USBD_STATE_READY;

    return true;
}

static bool __svc_stm32wb_usbd_start(void)
{
    if (!stm32wb_usbd_control.connect)
    {
        stm32wb_usbd_control.connect = true;

        if (stm32wb_usbd_control.state == STM32WB_USBD_STATE_ATTACHED)
        {
            stm32wb_usbd_connect();
        }
    }
    
    return true;
}

static bool __svc_stm32wb_usbd_stop(void)
{
    if (stm32wb_usbd_control.connect)
    {
        stm32wb_usbd_control.connect = false;

        if (stm32wb_usbd_control.state >= STM32WB_USBD_STATE_POWERED)
        {
            stm32wb_usbd_disconnect();
        }
    }

    return true;
}

static bool __svc_stm32wb_usbd_wakeup(void)
{
#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
    if (stm32wb_usbd_control.suspended)
    {
        if (!stm32wb_usbd_control.remote_wakeup)
        {
            return false;
        }
        
        stm32wb_usbd_dcd_wakeup();
    }

    return true;
#else /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */

    return false;
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */
}

bool stm32wb_usbd_enable(stm32wb_usbd_event_callback_t callback, void *context)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_2((uint32_t)&__svc_stm32wb_usbd_enable, (uint32_t)callback, (uint32_t)context);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_usbd_enable(callback, context);
    }

    return false;
}

bool stm32wb_usbd_disable(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_usbd_disable);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_usbd_disable();
    }

    return false;
}

bool stm32wb_usbd_start(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_usbd_start);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_usbd_start();
    }

    return false;
}

bool stm32wb_usbd_stop(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_usbd_stop);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_usbd_stop();
    }

    return false;
}

bool stm32wb_usbd_wakeup(void)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_0((uint32_t)&__svc_stm32wb_usbd_wakeup);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_usbd_wakeup();
    }

    return false;
}

void stm32wb_usbd_self_powered(bool onoff)
{
    if (stm32wb_usbd_control.pin_vbus != STM32WB_GPIO_PIN_NONE)
    {
        stm32wb_usbd_control.self_powered = onoff;
    }
}

uint32_t stm32wb_usbd_state(void)
{
    return (stm32wb_usbd_control.state < STM32WB_USBD_STATE_ATTACHED) ? USB_STATE_NONE : (stm32wb_usbd_control.state - (STM32WB_USBD_STATE_ATTACHED - USB_STATE_ATTACHED));
}

bool stm32wb_usbd_is_suspended(void)
{
    return stm32wb_usbd_control.suspended;
}

void USBD_PVM1_SWIHandler(void)
{
    stm32wb_usbd_vbus_changed();
}
